Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: Sorry I let you down, Chas.
ru: Прости, что подвел тебя, Чез.

source: All ofyou.
ru: Всех вас.

source: I been trying to make it up to you.
ru: Я постараюсь это исправить.

source: What' s his name?
ru: Как его зовут?

source: Spark Plug.
ru: Свеча Зажигания.

source: Thankyou.
ru: Спасибо.

source: You' rewelcome.
ru: Всегда пожалуйста.

source: I' ve had a rough year, Dad.
ru: Я меня был трудный год, папа.

source: I know you have, Chassie.
ru: Я знаю, Часси.

source: See, now he has more white feathers on his neck.
ru: Посмотри, сейчас у него больше белых перьев на шее.

source: I wonder what happened to him?
ru: Интересно, что с ним случилось?

source: Sometimes if a person has a traumatic experience their hair turns white.
ru: Иногда, если у кого- то были травмирующие переживания его волосы седеют.

source: Well, I' m sure he' il get over it.
ru: Ну, я уверена, он с этим справился.

source: This was one of my first hiding places.
ru: Это был один из первых моих тайников.

source: How old do you think those are?
ru: Сколько им лет, как думаешь?

source: I' d say about ten years.
ru: Я бы сказала - около десяти.

source: Royal dug a hole for Buckley behind the garden shed and buried him in a canvas duffel bag.
ru: Ройал выкопал могилу для Бакли у ограды сада и похоронил его в парусиновой охотничьей сумке.

source: All right, boys.
ru: Хорошо, мальчики.

source: Say a prayer.
ru: Прочитайте молитву.

source: Dear Heavenly Father...
ru: Отче наш...

source: Etheline and Henry were married 48 hours later in judge' s chambers.
ru: Этелина и Генри поженились через 48 часов в кабинете судьи.

source: Margot' s new play was produced at the Cavendish Theatre.
ru: Новую пьесу Марго поставили в театре Кэвендиш.

source: This is my adopted daughter, Elaine Levinson.
ru: Этом моя приемная дочь, Элен Левинсон.

source: It ran forjust under two weeks and received mixed reviews.
ru: Она шла меньше двух недель и получила неоднозначные отзывы.

source: Yes, can the boy tell time?
ru: Да, может ли мальчик сказать, сколько времени?

source: Oh, my Lord, no.
ru: Нет, господи, нет.

source: Raleigh and Dudley went on a lecture tour to 11 universities in the promotion of their new book.
ru: Рейли и Дадли отправились в лекционную поездку по 11 университетам в поддержку их новой книги.

source: Eli checked himself into a rehabilitation hospital in North Dakota.
ru: Илай лег в реабилитационную больницу в Северной Дакоте.

source: Oh, hey, this is my sponsor, Runs With Two Horses.
ru: Это мой покровитель, Бегущий С Двумя Конями.

source: Wind' s blowing up a gale today.
ru: Сегодня сильный ветер.

source: This is the grip that Rod Laver used.
ru: Это удар, который использовал Род Лейвер.

source: Are you familiar with Laver?
ru: Вы знаете Лэйвера?

source: Richie started a program teaching competitive tennis to eight- to- 12 year olds at the 375th Street Y.
ru: Ричи начал обучать 8- 12- летних игре в теннис на 375- ой улице Y.

source: Game.
ru: Гейм.

source: Change sides.
ru: Поменяйтесь сторонами.

source: Royal had a heart attack at the age of 68.
ru: У Ройала случился сердечный приступ в возрасте 68 лет.

source: Chas rode with him in the ambulance and was the only witness to his father' s death.
ru: Чез ехал с ним в машине скорой помощи и был единственным свидетелем смерти отца.

source: In his will, he stipulated that his funeral take place at dusk.
ru: По его воле, он завещал чтобы его похороны состоялись на закате.

source: Among the few possessions he left to his heirs was a set of Encyclopedia Britannica in storage at the Lindbergh Palace Hotel under the names Ari and Uzi Tenenbaum.
ru: Среди прочих вещей, которые он оставил наследникам, было собрание Британской энциклопедии в хранилище Линдберг Палас отеля на имена Ари и Узи Тененбаумов.

source: No one spoke at the funeral and Father Petersen' s leg had not yet mended... but it was agreed among them that Royal would have found the event to be most satisfactory.
ru: Но они согласились то Ройал нашел бы церемонию самой лучшей.

source: Ripped by iMRAN (wiseone@ kipl. net)
ru: Приезжайте в Лос- Анджелес!

source: I deliver perfection... and don' t brag about it!; -)
ru: Солнце сияет ярко.

source: Come to Los Angeles.
ru: Пляжи широки.

source: The beaches are wide and inviting.
ru: Апельсиновые рощи тянутся, насколько хватает глаз.

source: And the orange groves stretch as far as the eye can see.
ru: "СЕКРЕТЫ ЛОС- АНДЖЕЛЕСА"

source: There are jobs aplenty.
ru: Работы полно.

source: Every workingman can have his own house.
ru: Каждый работающий может иметь свой дом.

source: And inside every house, a happy all- American family.
ru: А в доме настоящую счастливую американскую семью.

source: And who knows?
ru: Вы можете иметь всё это и, кто знает...... Может, вас заметят.

source: You could even be discovered...... become a movie star, or at least see one.
ru: И вы станете кинозвездой, или, по крайней мере, увидите их.

source: Life is good in Los Angeles.
ru: Жизнь хороша в Лос- Анджелесе.

source: lt´s paradise on earth.
ru: Это рай на земле!

source: That´s what they tell you, anyway.
ru: Так нам рассказывают, во всяком случае.

source: Because they´re selling an image.
ru: Потому что они торгуют имиджем.

source: They´re selling it through movies, radio and television.
ru: Они продают его через кино, радио и телевидение.

source: ln the hit show, Badge of Honor, the L. A. cops walk on water...... as they keep the city clean of crooks.
ru: В популярном телешоу "Знак чести"...... полицейские ходят по воде, очищают город от преступников.

source: You´d think this place was the Garden of Eden.
ru: Можно подумать, что это райский сад.

source: But there´s trouble in paradise...... and his name is Meyer Harris Cohen, Mickey C, to his fans.
ru: Но в раю тоже есть неприятность, и она зовётся Майер Харрис Коэн.

source: Local L. A. color to the nth degree.
ru: Микки Си - для поклонников.

source: And his number one bodyguard...... Johnny Stompanato.
ru: Вот он смотрит искоса на 80 градусов.

source: Mickey C´s the head of organized crime in these parts.
ru: Микки Си - глава организованной преступности.

source: He runs dope, rackets and prostitution.
ru: Он занимается рэкетом, наркотиками и проститутками.

source: He kills a dozen people a year.
ru: Он убивает дюжину людей в год!

source: And the dapper little gent does it in style.
ru: И этот маленький щёголь делает это с шиком.

source: And every time his picture´s on the front page...... it´s a black eye for the image of Los Angeles.
ru: Каждый раз, когда его фотография попадает на первую полосу -...... это чёрное пятно на репутации Лос- Анджелеса.

source: Because how can organized crime exist...... in the city with the best police force in the world?
ru: Потому что, как может организованная преступность существовать...... в городе с лучшей полицией в мире?

source: Something has to be done.
ru: Что- то надо сделать.

source: But nothing too original, because, hey, this is Hollywood. what worked for Al Capone would work for the Mickster.
ru: Потому что, эй, это же Голливуд!

source: Mr. Cohen, you´re under arrest.
ru: То, что получилось с Аль Капоне, получится и с Микки Си.

source: Nonpayment of federal income tax.
ru: Мистер Коэн, вы арестованы за неуплату федеральных налогов.

source: But all is not well.
ru: Но это нехорошо.

source: Sending Mickey up has created a vacuum.
ru: Арест Микки создаёт вакуум.

source: And it´s only a matter of time...... before someone with balls of brass tries to fill it.
ru: И только вопрос времени, когда кто- нибудь попытается занять его.

source: ... you heard it here first...... off the record...... on the q. t...... and very...... Hush- Hush. "
ru: Запомните, дорогие читатели:... Вы услышали это первыми.... Не для записи.... И только для вас в очень популярном журнале "Хаш- Хаш".

source: You´re like Santa Claus with that list.
ru: "В тюрьме с Микки Си"

source: Except everyone on it´s been naughty.
ru: Только все на нём были озорниками.

source: Guy´s been out of Q two weeks.
ru: Оставь это на потом.

source: Leave it for later. we´ve got to pick up the booze and get it to the station.
ru: Мы должны купить выпивку и успеть в участок.

source: Hollywood, this is 6- Adam- 7.
ru: Голливуд, это 6- Эдем- 7.

source: Have Central send a prowler to 4216 Evergreen.
ru: 4- 2- 1 6 Эвер Грин.

source: Parole violation: assault arising from a family dispute. we won´t be here.
ru: Нас здесь не будет, но они его увидят.

source: They´il see him.
ru: Да хватит ныть!

source: Quit whining!
ru: Заткнись!

source: Quit whining all the time!
ru: Что ты ноешь всё время?

source: It makes me sick!
ru: Заткнись!

source: who the hell are you?
ru: Ты, чёрт, кто такой?

source: The ghost of Christmas past.
ru: Призрак из прошлого Рождества.

source: Dance with a man for a change? what are you, a smart ass?
ru: - Может, потолкуешь с мужчиной для разнообразия?

source: Youll be out in a year and a half.
ru: - Умничаешь, засранец?

source: l´il get cozy with your parole officer.
ru: Я договорюсь с твоим начальством.

source: You touch her again, l´il have you violated on a kiddie raper beef.
ru: Тронешь её ещё раз, я тебя оформлю за изнасилование малолетней.

source: You know what they do to kiddie rapers in Quentin.
ru: Ты знаешь, что с такими делают в тюрьме Сант- Квентин.

source: You have someplace you can go?
ru: У вас есть куда пойти?

source: Go get yourself fixed up.
ru: Устроитесь где- нибудь.

source: - Merry Christmas, ma´am.
ru: - Счастливого Рождества, мэм.

source: - Let´s go, Bud.
ru: - Поехали, Бад.

source: The guys´il be waiting.
ru: Ребята ждут.

source: what do you do on Badge of Honor?
ru: А что ты делаешь в сериале "Знак чести", Джек?

source: l´m the technical advisor.
ru: Я технический советник.

source: I teach Brett Chase how to walk and talk like a cop.
ru: Учу Брэда Чейса ходить и говорить, как коп.

source: Brett Chase doesn´t walk and talk like you.
ru: Брэд Чейс не ходит и не говорит, как ты.

source: That´s because he´s the television version.
ru: Но это потому, что он всего лишь телевизионный вариант.

source: America isn´t ready for the real me.
ru: - Это правда, что ты арестовал Бада Митчела?

source: ls it true you´re the one who arrested Bob Mitchum?
ru: Эти ребята в "Знаке чести" могут только притворяться.

source: Badge of Honor guys pretend.
ru: А ты настоящий.

source: But being the real thing must be a thrill. why don´t we go someplace quiet?
ru: Может, поедем куда- нибудь в спокойное местечко?

source: l´il give you the lowdown on Mitchum.
ru: - Расскажу тебе о Митчеле.

source: Big V. Jack Vincennes.
ru: Джек Винсенс.

source: - May I have this dance?
ru: - Можно мне потанцевать?

source: This is Sid Hudgens with Hush- Hush magazine.
ru: - Карен, это Сид Хадженс из журнала "Хаш- Хаш".

source: - Hello, Karen.
ru: - Привет, Карен.

source: - Hello yourself.
ru: Что всё это значит?

source: what´s that about? we did a piece, "lngenue Dikes in Hollywood." Her name got mentioned.
ru: Мы писали о малолетних лесбиянках Голливуда в прошлом году.

source: Jackie- boy...... a friend just sold some reefer to Matt Reynolds.
ru: Эй, Джеки Бой, мой приятель только что толкнул марихуану Мэту Рейнольдсу.

source: He´s tripping the light fantastic with Tammy Jordan.
ru: - Джек.

source: Sorry, I lost you for a second, Sid.
ru: Прости, я отвлёкся на пару секунд.

source: Contract players, Metro.
ru: Актёры из "Мэтро".

source: You pinch them, I do a nice feature next issue.
ru: Арестуешь их, я помещу о тебе статью.

source: - Plus the usual $50 cash.
ru: - Плюс 50 наличными.

source: - No, I need another $50.
ru: - Мне нужно ещё 50.

source: Two $20´s for two patrolmen, a dime for the Hollywood Station watch commander.
ru: По двадцатке патрульным и десятку начальнику смены Голливудского участка.

source: Jackie, it´s Christmas.
ru: Джек, это Рождество.

source: No, it´s not.
ru: Нет уж.

source: lt´s felony possession of marijuana.
ru: Это преступное владение марихуаной.

source: Actually, it´s circulation 36, 000 and climbing.
ru: Ну, вообще- то, тираж выше 36 тысяч не растёт.

source: There´s no telling where this will go.
ru: Трудно сказать, чем это всё кончится.

source: Radio, television.
ru: Радио, телевидение.

source: Once you whet the public´s appetite for the truth, the sky´s the limit.
ru: Когда у публики разгорается аппетит на правду, чего хочешь можно достичь.

source: Sergeant Ed Exley, son of the legendary Preston Exley.
ru: Сержант Эд Эксли, сын легендарного полицейского Эксли.

source: Must be a hard act to follow.
ru: Должно быть, трудно идти по стопам отца?

source: why not make a mark somewhere else? why become a cop, Ed?
ru: Я люблю помогать людям.

source: I like to help people. we heard 2 officers were assaulted this evening. - what do you think about that?
ru: Мы слышали, на двух офицеров напали сегодня ночью.

source: - Goes with the job.
ru: Что думаете об этом?

source: I took the report.
ru: Это часть нашей работы.

source: Luckily, they´re okay.
ru: К счастью, с ними всё в порядке.

source: Aren´t you young to be watch commander?
ru: - Не слишком ли вы молоды, чтобы быть начальником смены?

source: lt´s only tonight.
ru: - Это только сегодня.

source: That´s a good lead for the story.
ru: - Всех женатых людей отпустили на Рождество.

source: Merry Christmas, Captain.
ru: - Хорошее начало статьи.

source: - Captain Smith.
ru: Капитан Смит.

source: - Drop the formalities, Bobby.
ru: Не надо формальностей, Бобби, сегодня Рождество.

source: - lt´s Christmas Eve, call me Dudley.
ru: Зови меня Дадли.

source: - I came up with a title for the story.
ru: Я придумал хорошее название статьи:

source: l´m calling it "Silent Night with the LAPD."
ru: "Тихая ночь Лос- Анджелеской полиции".

source: That´s grand.
ru: О, это здорово.

source: Now remember, Bobby, that´s "Smith." with an "S."
ru: И запомни, Бобби: моя фамилия - Смит, начинается на "С".

source: Thank you, gentlemen.
ru: - Спасибо, господа.

source: Hold on there, lads.
ru: Первый из 23- х.

source: I saw the test results on the lieutenant´s exam.
ru: Я подумал о детективном бюро.

source: First out of 23. what´il it be, then?
ru: Эдмон, ты прирождённый политик.

source: Patrol Division?
ru: Вы ошибаетесь, сэр.

source: I was thinking Detective Bureau.
ru: - Дадли, если это нужно.

source: Edmund...... you´re a political animal.
ru: - Нет.

source: You have the eye for human weakness, but not the stomach.
ru: - Ты хотел бы выбивать признание из подозреваемого?

source: You´re wrong, sir. would you be willing to plant evidence on a suspect you knew to be guilty...... in order to insure an indictment? - we´ve been over this.
ru: Ты готов стрелять преступнику в спину, чтобы потом...... какой- нибудь адвокат его не отпустил?

source: - Yes or no?
ru: - Нет.

source: No. would you beat a confession out of a suspect you knew to be guilty? would you shoot a hardened criminal in the back...... in order to offset the chance that some lawyer --
ru: Тогда, ради Бога, не становись детективом.

source: Then for the love of God...... don´t be a detective. work where you don´t have to make those kind of choices.
ru: Найди себе дело, где не придётся делать такой выбор.

source: Dudley, I know you mean well...... but I don´t need to do it the way you did... or my father.
ru: Дадли, я знаю, вы хотите мне добра.

source: At least get rid of the glasses.
ru: Но не надо это делать так, как вы делаете.

source: I can´t think of a man on the Bureau who wears them.
ru: Или мой отец.

source: lf I get held up, you guys better be here.
ru: По крайней мере, избавься от очков.

source: I need a delivery.
ru: Я не могу представить, чтобы кто- то в моём бюро носил очки.

source: A case each of gin, rum, Scotch.
ru: Привет, Ник, мне нужно доставить товар.

source: Be right with you.
ru: Ящик джина, рома и скотча.

source: Merry Christmas to you, officer.
ru: Хорошая, видно, будет вечеринка, Лин.

source: That obvious?
ru: Я сейчас.

source: lt´s practically stamped on your forehead.
ru: Счастливого Рождества.

source: There you go.
ru: - Что, так заметно?

source: See what he wants, Buzz.
ru: Держи, Уайт.

source: Get lost, why don´t you?
ru: Посмотри, что ему надо, Баз.

source: Get your fucking head down.
ru: Чего тебе надо?

source: I got a license for that.
ru: Ну ладно, полегче.

source: Cut me some slack.
ru: Полегче.

source: I used to be a cop.
ru: Я сам был копом.

source: "Leland Meeks."
ru: - Вилан Минкс?

source: Never heard of you.
ru: Никогда не слышал о таком.

source: They call me Buzz.
ru: - Меня зовут Баз.

source: I don´t give a rat´s ass what they call you.
ru: Мне плевать, как тебя зовут.

source: She´s fine.
ru: Вы в порядке?

source: l´m not asking you, sir.
ru: - С ней всё хорошо.

source: Somebody hit you?
ru: - Я не вас спрашиваю, сэр.

source: lt´s not what you think.
ru: - Это не то, что вы думаете.

source: what is it, then?
ru: - А что тогда?

source: You got the wrong idea, mister.
ru: - Вы ошибаетесь, мистер, со мной всё в порядке.

source: But it´s nice to know you care.
ru: Но приятно знать, что вам не безразлично.

source: what´s going on?
ru: Что происходит?

source: Yeah, l´ve seen him around.
ru: Да, я его видел.

source: He used to be a cop.
ru: Он раньше был копом.

source: They´re sitting in the dark, goofing on the Christmas tree.
ru: Они сидят в темноте, пялятся на рождественскую ёлку!

source: Put your camera right there. when I walk out, l´il stop here.
ru: Ладно, поставьте камеру вот здесь.

source: I like it.
ru: Когда я выйду, остановлюсь вот здесь, чтобы было видно панораму.

source: "The Movie Premiere Pot Bust." when I walk out, I don´t want your floodlights in my eyes.
ru: Мне нравится, нравится!

source: Consider it done.
ru: Арест в день премьеры.

source: You hear that, Chip?
ru: Хорошо, будет сделано.

source: Get down.
ru: Ты слышал это?

source: Pop them!
ru: Пригнитесь.

source: Freeze!
ru: Давай снимай.

source: Police!
ru: Не двигаться.

source: Come on, let´s go.
ru: - Пошли, пошли.

source: My family´s coming in --
ru: - У меня семья завтра приезжает!

source: - lt´il be a nice Christmas gift.
ru: - Хороший будет рождественский подарок.

source: - Hi, Tammy.
ru: Привет, Теми.

source: Right over here.
ru: Привет, Мэт.

source: - Just turn.
ru: - Сюда.

source: - The Movie Premiere Pot Bust!
ru: - Повернулись.

source: - Take them in. l´il get the evidence.
ru: - Так, осторожней.

source: "lt´s Christmas Eve in the City of Angels...... and while decent citizens sleep the sleep of the righteous...... hopheads prowl for marijuana...... not knowing that a man is coming to stop them:
ru: Отвезите их в голливудский участок, я приеду оформлю.

source: Celebrity crime- stopper, Jack Vincennes.
ru: "Всё, что пожелаете" - Флёр де Ли.

source: Scourge of grasshoppers and dope fiends everywhere. "
ru: В "Городе ангелов" канун Рождества.

source: Yeah, subtle.
ru: Тебе нравится, Джеки Бой?

source: what took you?
ru: Да, изящно.

source: My partner stopped to help a damsel in distress.
ru: - Что так долго, Стенсленд?

source: His priorities are all screwed up.
ru: - Мой партнёр остановился помочь дамочке в беде.

source: Up to your old tricks again, Bud?
ru: Не знает, что надо делать в первую очередь.

source: Hollywood Jack, what brings you to our humble station house?
ru: Опять ты за свои шуточки, Бад?

source: - How are you? - why are you here?
ru: - Эй, Джек.

source: Keeping the streets safe.
ru: - Голливудский Джек?

source: Take these two, get them dressed and book them.
ru: Что привело тебя в наш скромный участок?

source: - The party´s upstairs.
ru: - Ты зачем здесь?

source: - Okay, l´il be right up.
ru: - Да, сэр.

source: what´s that for?
ru: - Вечеринка наверху.

source: You are watch commander tonight, aren´t you?
ru: - Хорошо, я сейчас поднимусь.

source: A gratuity from Hush- Hush magazine.
ru: Это благодарность от журнала "Хаш- Хаш".

source: Buy yourself some new loafers.
ru: Купишь себе пару новых кроссовок.

source: No thanks, Jack.
ru: Нет, спасибо, Джек.

source: l´m not interested.
ru: Оставь себе эту взятку.

source: what the hell is this?
ru: Мне неинтересно.

source: The ones who assaulted Brown and Helenowski.
ru: Что это такое, чёрт возьми?

source: I heard Helenowski bled 6 pints and Brown´s in a coma.
ru: 6 мексикашек, сэр.

source: They have bruises and muscle pulls.
ru: Которые напали на Брауна и Келиновски.

source: lt´s not what I heard.
ru: - Я слышал другое.

source: Get them into lock up.
ru: Заприте их.

source: Stens, you guys hear what those taco benders did to Helenowski and Brown?
ru: Ребята, вы слышали, что эти мексикашки сделали с Келиновски и Брауном?

source: Helenowski lost an eye, and they´re reading Brown his last rites.
ru: Келиновски потерял глаз, а Брауну уже причастие зачитывают.

source: That ought to make for a very merry Christmas for them.
ru: Да, не очень весёлое будет Рождество у Келиновски и Брауна.

source: Guys.
ru: Эй, ребята, ребята.

source: They brought the Mexicans in.
ru: Они привезли мексиканцев.

source: - Let´s do it.
ru: Они внизу, Стенс.

source: Let´s get them.
ru: Пойдём покажем им!

source: Stensland, the party´s upstairs.
ru: Эй, Стенсленд, вечеринка наверху.

source: Come on, guys.
ru: Ребята, вам что, нечем заняться?

source: Haven´t you got work?
ru: Возвращайтесь на вечеринку.

source: Go back to the party.
ru: - Да ладно, сегодня же Рождество.

source: - Come on, it´s Christmas, help me out.
ru: Что вы делаете?

source: - Move it!
ru: - Уйди с дороги.

source: I just got a few more questions.
ru: К Рождеству надо задать ещё несколько вопросов.

source: You don´t have to be here.
ru: Ребята, ну уходите.

source: You better put a leash on your partner before he kills somebody.
ru: Уайт, лучше надень поводок на своего партнёра, пока он кого- нибудь не убил.

source: Teach him a lesson!
ru: - Дайте им!

source: Get him, Stens!
ru: - Покажи им, Стенс.

source: This is for ours, Poncho.
ru: Это тебе за наших, пончо.

source: He didn´t do nothing! what are you looking at?
ru: - Нет, он не сделал ничего!

source: Tell that Mexican to shut up!
ru: Чего уставился?

source: You´re sick!
ru: Эй, прекрати.

source: That´s it!
ru: Назад, назад!

source: Don´t break it up.
ru: - Да?

source: Get back!
ru: Мать твою!

source: Yeah, and fuck your mother!
ru: - Пошёл ты сам!

source: Fuck you!
ru: - Дай ему!

source: Stop, officer!
ru: - Прекратить, офицеры!

source: That´s an order!
ru: Это приказ!

source: You´il all be in my report!
ru: - Я о вас всех сообщу в рапорте!

source: "Bloody Christmas."
ru: - Иди отдохни, Эксли.

source: The press love to label.
ru: Кровавое Рождество?

source: You should know this is bigger than the police board.
ru: Пресса любит вешать ярлыки.

source: The grand jury´s convening.
ru: Будет суд.

source: lndictments may be handed down. will you testify?
ru: Будут выдвинуты обвинения.

source: District Attorney Loew?
ru: Окружной прокурор Леу.

source: You and officer Stensland brought the liquor to the station.
ru: Вы и офицер Стенсленд принесли спиртные напитки в участок.

source: Stensland was already drunk.
ru: Стенсленд был уже пьян.

source: Appearing as a voluntary witness against him...... could offset damage to yourself.
ru: Вы понимаете, что добровольная дача показаний поможет вам?

source: This man is a disgrace.
ru: - Этот человек позорит полицию.

source: Your badge and gun, officer.
ru: Ваш значок и револьвер, офицер.

source: You´re suspended from duty.
ru: Вы отстранены от службы.

source: Dismissed.
ru: Свободны.

source: we need police witnesses to offset the damage done to the Department.
ru: Эд, нам нужны свидетели- полицейские, чтобы нейтрализовать ущерб...... нанесённый управлению.

source: Justice has to be served.
ru: Я прошу...
